---
type: HVACLoadSpaceType
namespace: Autodesk.Revit.DB.Analysis
version: 2024
members: 5
tags: [revit-api, class]
---

# HVACLoadSpaceType

`Autodesk.Revit.DB.Analysis.HVACLoadSpaceType` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2018 | `public static HVACLoadSpaceType Create ( Document document , string name )` |
| Method | IsNameUnique | — | `` |
| Property | IsPlenum | 2018 | `public bool IsPlenum { get ; }` |
| Property | Parameter | — | `` |
| Property | SpaceTypeName | 2018 | `public string SpaceTypeName { get ; set ; }` |